W4D5/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("name", "yr", "created_at", "updated_at", "band_id", "recording_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "slim shady ep"], ["yr", 2006], ["created_at", "2019-04-04 22:27:22.970068"], ["updated_at", "2019-04-04 22:27:22.970068"], ["band_id", 7], ["recording_type", false]]
---
    def create
        @album = Album.new(album_params)
        if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "yr" = $1, "recording_type" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["yr", 200999], ["recording_type", true], ["updated_at", "2019-04-04 23:20:09.050779"], ["id", 1]]
---
    def update
         @album = Album.find(params[:id])
        if @album.update_attributes(album_params)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 11]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def destroy
        Album.find(params[:id]).delete