W4D5/music_app/app/controllers/bands_controller.rb

    def destroy
        Band.find(params[:id]).delete
---
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]