W4D5/music_app/app/controllers/tracks_controller.rb

    def create
        @track = Track.new(track_params)
        if @track.save
            @album = Album.find(track_params[:album_id])
            flash[:errors] = @track.errors.full_messages
            redirect_to album_url(@album)
        else
            @album = Album.find(track_params[:album_id])
---
INSERT INTO "tracks" ("title", "album_id", "ord", "track_type", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "bla"], ["album_id", 2], ["ord", 2], ["track_type", false], ["lyrics", ""], ["created_at", "2019-04-05 00:29:05.176284"], ["updated_at", "2019-04-05 00:29:05.176284"]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]