W4D5/music_app/app/views/tracks/new.html.erb

            <select name="track[album_id]">
                <% Album.all.each do |album|%>
---
SELECT "albums".* FROM "albums"