W4D5/music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE (album_id = 2)
---
        <ul class="band-list">
        <% my_tracks = Track.where("album_id = ?", @album.id)%>