W4D5/music_app/app/views/bands/show.html.erb

        <h2> Albums: </h2>
        <% my_albums = Album.where("band_id = ?", @band.id)%>
---
SELECT "albums".* FROM "albums" WHERE (band_id = 9)